mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_TSI.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- TSI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSI_Peripheral_Access_Layer TSI Peripheral Access Layer
 * @{
 */

/** TSI - Register Layout Typedef */
typedef struct {
  union {                                          /* offset: 0x0 */
    __IO uint32_t CONFIG_MUTUAL;                     /**< TSI CONFIG (TSI_CONFIG) for Mutual-Capacitor, offset: 0x0 */
    __IO uint32_t CONFIG;                            /**< TSI CONFIG (TSI_CONFIG) for Self-Capacitor, offset: 0x0 */
  };
  __IO uint32_t TSHD;                              /**< TSI Threshold, offset: 0x4 */
  __IO uint32_t GENCS;                             /**< TSI General Control and Status, offset: 0x8 */
  __IO uint32_t MUL;                               /**< TSI Mutual-Capacitance, offset: 0xC */
  __IO uint32_t SINC;                              /**< TSI SINC Filter, offset: 0x10 */
  __IO uint32_t SSC0;                              /**< TSI SSC 0, offset: 0x14 */
  __IO uint32_t SSC1;                              /**< TSI SSC 1, offset: 0x18 */
  __IO uint32_t SSC2;                              /**< TSI SSC 2, offset: 0x1C */
  __IO uint32_t BASELINE;                          /**< TSI Baseline, offset: 0x20 */
  __IO uint32_t CHMERGE;                           /**< TSI Channel Merge, offset: 0x24 */
  __IO uint32_t SHIELD;                            /**< TSI Shield, offset: 0x28 */
       uint8_t RESERVED_0[212];
  __IO uint32_t DATA;                              /**< TSI Data and Status, offset: 0x100 */
       uint8_t RESERVED_1[4];
  __IO uint32_t MISC;                              /**< TSI Miscellaneous, offset: 0x108 */
  __IO uint32_t TRIG;                              /**< TSI AUTO TRIG, offset: 0x10C */
} TSI_Type;

/* ----------------------------------------------------------------------------
   -- TSI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSI_Register_Masks TSI Register Masks
 * @{
 */

/*! @name CONFIG_MUTUAL - TSI CONFIG (TSI_CONFIG) for Mutual-Capacitor */
/*! @{ */

#define TSI_CONFIG_MUTUAL_MODE_MASK              (0x1U)
#define TSI_CONFIG_MUTUAL_MODE_SHIFT             (0U)
/*! MODE - Mode
 *  0b0..Self capacitance
 *  0b1..Mutual capacitance
 */
#define TSI_CONFIG_MUTUAL_MODE(x)                (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_MODE_SHIFT)) & TSI_CONFIG_MUTUAL_MODE_MASK)

#define TSI_CONFIG_MUTUAL_M_NMIRROR_MASK         (0x6U)
#define TSI_CONFIG_MUTUAL_M_NMIRROR_SHIFT        (1U)
/*! M_NMIRROR - NMOS Current Mirror
 *  0b00..m = 1
 *  0b01..m = 2
 *  0b10..m = 3
 *  0b11..m = 4
 */
#define TSI_CONFIG_MUTUAL_M_NMIRROR(x)           (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_NMIRROR_SHIFT)) & TSI_CONFIG_MUTUAL_M_NMIRROR_MASK)

#define TSI_CONFIG_MUTUAL_M_PMIRRORR_MASK        (0x18U)
#define TSI_CONFIG_MUTUAL_M_PMIRRORR_SHIFT       (3U)
/*! M_PMIRRORR - PMOS Current Mirror on Right Side
 *  0b00..m = 1
 *  0b01..m = 2
 *  0b10..m = 3
 *  0b11..m = 4
 */
#define TSI_CONFIG_MUTUAL_M_PMIRRORR(x)          (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PMIRRORR_SHIFT)) & TSI_CONFIG_MUTUAL_M_PMIRRORR_MASK)

#define TSI_CONFIG_MUTUAL_M_PMIRRORL_MASK        (0xE0U)
#define TSI_CONFIG_MUTUAL_M_PMIRRORL_SHIFT       (5U)
/*! M_PMIRRORL - PMOS Current Mirror on Left Side
 *  0b000..m = 4
 *  0b001..m = 8
 *  0b010..m = 12
 *  0b011..m = 16
 *  0b100..m = 20
 *  0b101..m = 24
 *  0b110..m = 28
 *  0b111..m = 32
 */
#define TSI_CONFIG_MUTUAL_M_PMIRRORL(x)          (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PMIRRORL_SHIFT)) & TSI_CONFIG_MUTUAL_M_PMIRRORL_MASK)

#define TSI_CONFIG_MUTUAL_M_SEL_RX_MASK          (0x1F00U)
#define TSI_CONFIG_MUTUAL_M_SEL_RX_SHIFT         (8U)
/*! M_SEL_RX - Mutual-Capacitance RX Channel Selection
 *  0b00000..TSI[8]
 *  0b00001..TSI[9]
 *  0b00010..TSI[10]
 *  0b00011..TSI[11]
 *  0b00100..TSI[12]
 *  0b00101..TSI[13]
 *  0b00110..TSI[14]
 *  0b00111..TSI[15]
 *  0b01000..TSI[16]
 *  0b01001..TSI[17]
 *  0b01010..TSI[18]
 *  0b01011..TSI[19]
 *  0b01100..TSI[20]
 *  0b01101..TSI[21]
 *  0b01110..TSI[22]
 *  0b01111..TSI[23]
 *  0b10000..TSI[24]
 */
#define TSI_CONFIG_MUTUAL_M_SEL_RX(x)            (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_SEL_RX_SHIFT)) & TSI_CONFIG_MUTUAL_M_SEL_RX_MASK)

#define TSI_CONFIG_MUTUAL_M_SEL_TX_MASK          (0xE000U)
#define TSI_CONFIG_MUTUAL_M_SEL_TX_SHIFT         (13U)
/*! M_SEL_TX - Mutual-Capacitance TX Channel Selection
 *  0b000..TSI[0]
 *  0b001..TSI[1]
 *  0b010..TSI[2]
 *  0b011..TSI[3]
 *  0b100..TSI[4]
 *  0b101..TSI[5]
 *  0b110..TSI[6]
 *  0b111..TSI[7]
 */
#define TSI_CONFIG_MUTUAL_M_SEL_TX(x)            (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_SEL_TX_SHIFT)) & TSI_CONFIG_MUTUAL_M_SEL_TX_MASK)

#define TSI_CONFIG_MUTUAL_M_CNT_EN_MASK          (0x10000U)
#define TSI_CONFIG_MUTUAL_M_CNT_EN_SHIFT         (16U)
/*! M_CNT_EN - Mutual-Capacitance Counter Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_CONFIG_MUTUAL_M_CNT_EN(x)            (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_CNT_EN_SHIFT)) & TSI_CONFIG_MUTUAL_M_CNT_EN_MASK)

#define TSI_CONFIG_MUTUAL_M_TX_PD_EN_MASK        (0x20000U)
#define TSI_CONFIG_MUTUAL_M_TX_PD_EN_SHIFT       (17U)
/*! M_TX_PD_EN - Mutual-Capacitance TX Pulldown Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_CONFIG_MUTUAL_M_TX_PD_EN(x)          (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_TX_PD_EN_SHIFT)) & TSI_CONFIG_MUTUAL_M_TX_PD_EN_MASK)

