mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_TSI.h
#define TSI_CONFIG_MUTUAL_M_SEN_BOOST_MASK       (0x7C0000U)
#define TSI_CONFIG_MUTUAL_M_SEN_BOOST_SHIFT      (18U)
/*! M_SEN_BOOST - Mutual-Capacitance Sensitivity Boost
 *  0b00000..0 uA
 *  0b00001..2 uA
 *  0b00010..4 uA
 *  0b00011..6 uA
 *  0b00100..8 uA
 *  0b00101..10 uA
 *  0b00110..12 uA
 *  0b00111..14 uA
 *  0b11111..62 uA
 *  0b1xxxx..2 * n uA
 */
#define TSI_CONFIG_MUTUAL_M_SEN_BOOST(x)         (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_SEN_BOOST_SHIFT)) & TSI_CONFIG_MUTUAL_M_SEN_BOOST_MASK)

#define TSI_CONFIG_MUTUAL_M_PRE_RES_MASK         (0x1C000000U)
#define TSI_CONFIG_MUTUAL_M_PRE_RES_SHIFT        (26U)
/*! M_PRE_RES - Mutual-Capacitance Precharge Resistor
 *  0b000..1 kΩ
 *  0b001..2 kΩ
 *  0b010..3 kΩ
 *  0b011..4 kΩ
 *  0b100..5 kΩ
 *  0b101..6 kΩ
 *  0b110..7 kΩ
 *  0b111..8 kΩ
 */
#define TSI_CONFIG_MUTUAL_M_PRE_RES(x)           (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PRE_RES_SHIFT)) & TSI_CONFIG_MUTUAL_M_PRE_RES_MASK)

#define TSI_CONFIG_MUTUAL_M_PRE_CURRENT_MASK     (0xE0000000U)
#define TSI_CONFIG_MUTUAL_M_PRE_CURRENT_SHIFT    (29U)
/*! M_PRE_CURRENT - Mutual-Capacitance Precharge Current
 *  0b000..1 uA
 *  0b001..2 uA
 *  0b010..3 uA
 *  0b011..4 uA
 *  0b100..5 uA
 *  0b101..6 uA
 *  0b110..7 uA
 *  0b111..8 uA
 */
#define TSI_CONFIG_MUTUAL_M_PRE_CURRENT(x)       (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PRE_CURRENT_SHIFT)) & TSI_CONFIG_MUTUAL_M_PRE_CURRENT_MASK)
/*! @} */

/*! @name CONFIG - TSI CONFIG (TSI_CONFIG) for Self-Capacitor */
/*! @{ */

#define TSI_CONFIG_MODE_MASK                     (0x1U)
#define TSI_CONFIG_MODE_SHIFT                    (0U)
/*! MODE - Mode
 *  0b0..Self capacitance
 *  0b1..Mutual capacitance
 */
#define TSI_CONFIG_MODE(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MODE_SHIFT)) & TSI_CONFIG_MODE_MASK)

#define TSI_CONFIG_TSICH_MASK                    (0x3EU)
#define TSI_CONFIG_TSICH_SHIFT                   (1U)
/*! TSICH - TSI Channel
 *  0b00000..Channel 0
 *  0b00001..Channel 1
 *  0b00010..Channel 2
 *  0b00011..Channel 3
 *  0b00100..Channel 4
 *  0b00101..Channel 5
 *  0b00110..Channel 6
 *  0b00111..Channel 7
 *  0b01000..Channel 8
 *  0b01001..Channel 9
 *  0b01010..Channel 10
 *  0b01011..Channel 11
 *  0b01100..Channel 12
 *  0b01101..Channel 13
 *  0b01110..Channel 14
 *  0b01111..Channel 15
 *  0b10000..Channel 16
 *  0b10001..Channel 17
 *  0b10010..Channel 18
 *  0b10011..Channel 19
 *  0b10100..Channel 20
 *  0b10101..Channel 21
 *  0b10110..Channel 22
 *  0b10111..Channel 23
 *  0b11000..Channel 24
 */
#define TSI_CONFIG_TSICH(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_TSICH_SHIFT)) & TSI_CONFIG_TSICH_MASK)

#define TSI_CONFIG_S_NOISE_MASK                  (0x80000U)
#define TSI_CONFIG_S_NOISE_SHIFT                 (19U)
/*! S_NOISE - Self-Capacitance Noise Cancelation
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_CONFIG_S_NOISE(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_NOISE_SHIFT)) & TSI_CONFIG_S_NOISE_MASK)

#define TSI_CONFIG_S_XCH_MASK                    (0x700000U)
#define TSI_CONFIG_S_XCH_SHIFT                   (20U)
/*! S_XCH - Self-Capacitance Charge Current Multiple
 *  0b000..1 / 16
 *  0b001..1 / 8
 *  0b010..1 / 4
 *  0b011..1 / 2
 */
#define TSI_CONFIG_S_XCH(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_XCH_SHIFT)) & TSI_CONFIG_S_XCH_MASK)

#define TSI_CONFIG_S_XIN_MASK                    (0x800000U)
#define TSI_CONFIG_S_XIN_SHIFT                   (23U)
/*! S_XIN - Self-Capacitance Input Current Multiple
 *  0b0..1 / 8
 *  0b1..1 / 4
 */
#define TSI_CONFIG_S_XIN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_XIN_SHIFT)) & TSI_CONFIG_S_XIN_MASK)

#define TSI_CONFIG_S_CTRIM_MASK                  (0x7000000U)
#define TSI_CONFIG_S_CTRIM_SHIFT                 (24U)
/*! S_CTRIM - Capacitor Trim Setting
 *  0b000..2.5 pF
 *  0b001..5.0 pF
 *  0b010..7.5 pF
 *  0b011..10 pF
 *  0b100..12.5 pF
 *  0b101..15.0 pF
 *  0b110..17.5 pF
 *  0b111..20 pF
 */
#define TSI_CONFIG_S_CTRIM(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_CTRIM_SHIFT)) & TSI_CONFIG_S_CTRIM_MASK)

#define TSI_CONFIG_S_SEN_MASK                    (0x8000000U)
#define TSI_CONFIG_S_SEN_SHIFT                   (27U)
/*! S_SEN - Self-Capacitance Sensitivity Boost
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_CONFIG_S_SEN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_SEN_SHIFT)) & TSI_CONFIG_S_SEN_MASK)

#define TSI_CONFIG_S_XDN_MASK                    (0x70000000U)
#define TSI_CONFIG_S_XDN_SHIFT                   (28U)
/*! S_XDN - Self-Capacitance Discharge Current Multiple
 *  0b000..1 / 16
 *  0b001..1 / 8
 *  0b010..1 / 4
 *  0b011..1 / 2
 */
#define TSI_CONFIG_S_XDN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_XDN_SHIFT)) & TSI_CONFIG_S_XDN_MASK)

#define TSI_CONFIG_S_XIN_ADD_MASK                (0x80000000U)
#define TSI_CONFIG_S_XIN_ADD_SHIFT               (31U)
/*! S_XIN_ADD - S_XIN Adjust Ratio
 *  0b0..Disables; S_XIN = 0 for 1 / 4, S_XIN = 1 for 1 / 8
 *  0b1..Enables; S_XIN = 0 for 1 / 8, S_XIN = 1 for 1 / 16
 */
#define TSI_CONFIG_S_XIN_ADD(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_XIN_ADD_SHIFT)) & TSI_CONFIG_S_XIN_ADD_MASK)
/*! @} */

/*! @name TSHD - TSI Threshold */
/*! @{ */

#define TSI_TSHD_THRESL_MASK                     (0xFFFFU)
#define TSI_TSHD_THRESL_SHIFT                    (0U)
/*! THRESL - TSI Wakeup Channel Low Threshold */
#define TSI_TSHD_THRESL(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_TSHD_THRESL_SHIFT)) & TSI_TSHD_THRESL_MASK)

#define TSI_TSHD_THRESH_MASK                     (0xFFFF0000U)
#define TSI_TSHD_THRESH_SHIFT                    (16U)
/*! THRESH - TSI Wakeup Channel High Threshold */
#define TSI_TSHD_THRESH(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_TSHD_THRESH_SHIFT)) & TSI_TSHD_THRESH_MASK)
/*! @} */

/*! @name GENCS - TSI General Control and Status */
/*! @{ */

